#include "items.h"

const uint8_t* ITEM_MENU[] = { "Время/Дата", "Старт промывки", "Период промывки", "Фильтроцикл" };

const uint8_t* ITEM_SERVICE_MENU[] = { "Тип фильтра", "Тип промывки", "Внешний сигнал (ВХ1)", "Универсальный выход (ВЫХ1)", "ЭМК (ВЫХ2)","Сервисное обслуживание", "Контакты","Регулировка положений", "Настройка мотора"};// , "Регулировка", "Ручное управление" };

const uint8_t* ITEM_HISTORY_MENU[] = { "Промывки фильтра", "Потребление воды", "Максимальный расход", "Ошибки" };

const uint8_t* ITEM_FILTER_SELECTION[] = { "Фильтрация", "Умягчение", "Ручная настройка" };

const uint8_t* ITEM_FILTERING[] = { "Обратная промывка", "Прямая промывка"};

const uint8_t* ITEM_SOFTENING[] = { "Обратная промывка", "Засос солевого раствора", "Прямая промывка", "Заполнение солевого бака"};

//const uint8_t* ITEM_ADJUSTMENT = &ITEM_STEPS[];
//const uint8_t* ITEM_ERRORS[] = {"Отказ питания","Села батарейка","","","","","","","","","","","","","","","","История отказов"};

const uint8_t* ITEM_STEPS[] = { "Фильтрация", "Прямая промывка", "Обратная промывка", "Засос солевого раствора", "и медленная отмывка", "Заполнение солевого бака"};/*"Заполнение солевого бака и медленная отмывка"};*/ 

const uint8_t* ITEM_STEPS_WITH_MES[] = { "Фильтрация, мин", "Прямая промывка, мин", "Обратная промывка, мин", "Засос солевого раствора", "и медленная отмывка, мин", "Заполнение солевого бака", "кг"};/*"Заполнение солевого бака и медленная отмывка"};*/ 

const uint8_t* ITEM_IMPULSE_WEIGHT[] = {"1 л/мин","10 л/мин","100 л/мин","Вес импульсного выхода"};

const uint8_t* ITEM_MAIN_FRAME[] = {"ЦИКЛ УМЯГЧЕНИЯ","РЕЖИМ", "ОТЛ. РЕГЕН.", "СКОРОСТЬ","ВРЕМЯ", "ДНЕЙ","Л/МИН","ЧЧ:ММ"};

const uint8_t* ITEM_CLOCKSET_FRAME[] = {"ЧАСЫ","МИНУТЫ"};

const uint8_t* ITEM_PINCODE_FRAME[] = {"Пароль для сервиса","Пожалуйста, ведите пароль","Войти","Введите число" };

const uint8_t* ITEM_CALENDAR_FRAME[] = {"День","Месяц","Год"};

const uint8_t* ITEM_MANUAL_SETTINGS[] = {"Ручная настройка", "Добавить шаг"};

const uint8_t* ITEM_WATER_BR[] = {"Расход воды", "м"};

const uint8_t* ITEM_SERVICE_INFO[] = {"Сервисное обслуживание", "Дата следующего сервисного", "обслуживания", "Сервис выполнен", "Необходимо провести сервис", "Следующее сервисное обслуживание","сделать через:", "0", "3", "6", "9", "12", "Месяцев"};

const uint8_t* ITEM_LOAD_TYPE[] = {"По дням", "По часам", "Универсальная", "Немедленная", "Тип промывки"};

const uint8_t* ITEM_INPUT_ONE_FRAME[] = {"Удаленный запуск промывки", "Запрет промывки", "ВХ1"};

const uint8_t* ITEM_UNIVERSAL_OUTPUT_FRAME[] = {"Не активен", "Промывка фильтра", "Импульсный выход", "Запуск в промывку соседа", "ВЫХ1"};

const uint8_t* ITEM_EL_MAG_FRAME[] = {"ВЫХ2"};

const uint8_t* ITEM_MOTOR_SETTINGS[] = {"Настройки двигателя", "Максимальная скорость", "Замедленная скорость"};

const uint8_t* ITEM_HISTORY_ERROR[] = {"Журнал загружается"," ошибка N","Журнал пуст", "Промывка фильтра в "," л", " л/мин"};

const uint8_t* ITEM_TIME_ruText[] = { 
	"Дата/Время",
	"Установка даты и времени",
	"Год",
	"Месяц",
	"День",
	"Час",
	"Минуты",
	"Сохранить",
	"Сброс",
	"Установка даты и времени",
	"Введите год",
	"Введите месяц",
	"Введите день",
	"Введите час",
	"Введите минуты"
};