#include "items.h"

uint8_t* ITEM_MENU[] = { "Время/Дата", "Время промывки", "Принудительная рег.", "Отложенная рег.", "Дней между рег."};

uint8_t* ITEM_SERVICE_MENU[] = { "Выбор фильтра", "Период рег.", "Время промывки", "Счетчик воды", "Регенерация", "Регулировка клапана", "Уведомление обслуживания" };

uint8_t* ITEM_FILTER_SELECTION[] = { "Фильтрация", "Умягчение" };

uint8_t* ITEM_FILTERING[] = { "Обр.пром.", "Прям.пром."};

uint8_t* ITEM_SOFTENING[] = { "Обр.пром.", "Реаг.пром.", "Обр.пром.", "Прямая.пром.", "Заливка" };

uint8_t* ITEM_ADJUSTMENT[] = { "Закрытое пол.", "Обр.пром.", "РЕГЕНЕРАЦИЯ", "ЗАПОЛНЕНИЕ", "УМЯГЧЕНИЕ", "ПРОМЫВКА", "ФИЛЬТРАЦИЯ" };

uint8_t* ITEM_STEPS[] = { "ОБРАТНАЯ ПРОМЫВКА", "РЕГЕНЕРАЦИЯ", "ЗАПОЛНЕНИЕ", "УМЯГЧЕНИЕ", "ПРОМЫВКА", "ФИЛЬТРАЦИЯ" };

uint8_t* ITEM_MAIN_FRAME[] = {"ЦИКЛ УМЯГЧЕНИЯ","РЕЖИМ", "ОТЛ. РЕГЕН.", "СКОРОСТЬ","ВРЕМЯ", "ДНЕЙ","Л/МИН","ЧЧ:ММ"};

uint8_t* ITEM_CLOCKSET_FRAME[] = {"ЧАСЫ","МИНУТЫ"};

uint8_t* ITEM_PINCODE_FRAME[] = {"Пароль для сервиса","Введите пароль","Войти","Введите число" };

uint8_t* ITEM_CALENDAR_FRAME[] = {"День","Месяц","Год"};

uint8_t* ITEM_TIME_ruText[] = {
	"Дата/Время",
	"Установка даты и времени",
	"Год",
	"Месяц",
	"День",
	"Час",
	"Минуты",
	"Сохранить",
	"Сброс",
	"Установка даты и времени",
	"Введите год",
	"Введите месяц",
	"Введите день",
	"Введите час",
	"Введите минуты"
};