#include "items.h"

uint8_t* ITEM_MENU[] = { "ВРЕМЯ/ДАТА", "ВРЕМЯ ПРОМЫВКИ", "ПРИНУДИТЕЛЬНАЯ РЕГ.", "ОТЛОЖЕННАЯ РЕГ.", "ДНЕЙ МЕЖДУ РЕГ.", "СЕРВИС" };

uint8_t* ITEM_SERVICE_MENU[] = { "ВЫБОР ФИЛЬТРА", "ПЕРИОД РЕГЕН", "ВРЕМЯ ПРОМЫВКИ", "СЧЕТЧИК ВОДЫ", "РЕГЕНЕРАЦИЯ", "РЕГУЛИРОВКА КЛАПАНА", "УВЕДОМЛЕНИЯ ОБСЛУЖИВАНИЯ" };

uint8_t* ITEM_FILTER_SELECTION[] = { "ФИЛЬТРАЦИЯ", "УМЯГЧЕНИЕ" };

uint8_t* ITEM_FILTERING[] = { "ОБР.ПРОМ.", "ПРЯМ.ПРОМ."};

uint8_t* ITEM_SOFTENING[] = { "ОБР.ПРОМ.", "РЕАГ.ПРОМ.", "ВТОРАЯ.ПРОМ.", "ПРЯМАЯ.ПРОМ.", "ЗАЛИВКА" };

uint8_t* ITEM_ADJUSTMENT[] = { "ЗАКРЫТОЕ ПОЛ.", "ОБР. ПРОМ.", "РЕГЕНЕРАЦИЯ", "ЗАПОЛНЕНИЕ", "УМЯГЧЕНИЕ", "ПРОМЫВКА", "ФИЛЬТРАЦИЯ" };

uint8_t* ITEM_STEPS[] = { "ОБРАТНАЯ ПРОМЫВКА", "РЕГЕНЕРАЦИЯ", "ЗАПОЛНЕНИЕ", "УМЯГЧЕНИЕ", "ПРОМЫВКА", "ФИЛЬТРАЦИЯ" };

uint8_t* ITEM_MAIN_FRAME[] = {"ЦИКЛ УМЯГЧЕНИЯ","РЕЖИМ", "ОТЛ. РЕГЕН.", "СКОРОСТЬ","ВРЕМЯ", "ДНЕЙ","Л/МИН","ЧЧ:ММ"};

uint8_t* ITEM_CLOCKSET_FRAME[] = {"ЧАСЫ","МИНУТЫ"};

uint8_t* ITEM_PINCODE_FRAME[] = {"Пароль для сервиса","Введите пароль","ВВОД","Введите число" };

uint8_t* ITEM_TIME_ruText[] = {
	"Дата/Время",
	"Установка даты и времени",
	"ГОД",
	"МЕСЯЦ",
	"ДЕНЬ",
	"ЧАС",
	"МИНУТЫ",
	"СОХРАНИТЬ",
	"СБРОС",
	"Установка даты и времени",
	"Введите год",
	"Введите месяц",
	"Введите день",
	"Введите час",
	"Введите минуты"
};
