#include "items.h"

char* ITEM_MENU[] = { "бпелъ/дюрю", "бпелъ опнлшбйх", "опхмсдхрекэмюъ пец.", "нркнфеммюъ пец.", "дмеи лефдс пец.", "яепбхя" };

char* ITEM_SERVICE_MENU[] = { "бшанп тхкэрпю", "оепхнд пецем", "бпелъ опнлшбйх", "явервхй бндш", "пецемепюжхъ", "пецскхпнбйю йкюоюмю", "сбеднлкемхъ наяксфхбюмхъ" };

char* ITEM_FILTER_SELECTION[] = { "тхкэрпюжхъ", "слъцвемхе" };

char* ITEM_FILTERING[] = { "нап.опнл.", "опъл.опнл."};

char* ITEM_SOFTENING[] = { "нап.опнл.", "пеюц.опнл.", "брнпюъ.опнл.", "опълюъ.опнл.", "гюкхбйю" };

char* ITEM_ADJUSTMENT[] = { "гюйпшрне онк.", "нап. опнл.", "пецемепюжхъ", "гюонкмемхе", "слъцвемхе", "опнлшбйю", "тхкэрпюжхъ" };

char* ITEM_STEPS[] = { "напюрмюъ опнлшбйю", "пецемепюжхъ", "гюонкмемхе", "слъцвемхе", "опнлшбйю", "тхкэрпюжхъ" };