#include "items.h"

uint8_t* ITEM_MENU[] = { "Время/Дата", "Старт промывки", "Период промывки", "Фильтроцикл" };

uint8_t* ITEM_SERVICE_MENU[] = { "Тип фильтра", "Тип промывки", "Внешний сигнал (ВХ1)", "Универсальный выход (ВЫХ1)", "ЭМК (ВЫХ2)", "Сервисное обслуживание", "Контакты"};// , "Регулировка", "Ручное управление" };

uint8_t* ITEM_HISTORY_MENU[] = { "Промывки фильтра", "Потребление воды", "Максимальный расход", "Ошибки" };

uint8_t* ITEM_FILTER_SELECTION[] = { "Фильтрация", "Умягчение", "Ручная настройка" };

uint8_t* ITEM_FILTERING[] = { "Обратная промывка", "Прямая промывка"};

uint8_t* ITEM_SOFTENING[] = { "Обратная промывка", "Засос соленого раствора", "Прямая промывка", "Заполнение соленого бака"};

//uint8_t* ITEM_ADJUSTMENT = &ITEM_STEPS[];


uint8_t* ITEM_STEPS[] = { "Фильтрация", "Прямая промывка", "Обратная промывка", "Засос соленого раствора", "Заполнение соленого бака"};


uint8_t* ITEM_MAIN_FRAME[] = {"ЦИКЛ УМЯГЧЕНИЯ","РЕЖИМ", "ОТЛ. РЕГЕН.", "СКОРОСТЬ","ВРЕМЯ", "ДНЕЙ","Л/МИН","ЧЧ:ММ"};

uint8_t* ITEM_CLOCKSET_FRAME[] = {"ЧАСЫ","МИНУТЫ"};

uint8_t* ITEM_PINCODE_FRAME[] = {"Пароль для сервиса","Пожалуйста, ведите пароль","Войти","Введите число" };

uint8_t* ITEM_CALENDAR_FRAME[] = {"День","Месяц","Год"};

uint8_t* ITEM_MANUAL_SETTINGS[] = {"Ручная настройка", "Добавить шаг"};

uint8_t* ITEM_WATER_BR[] = {"Расход воды", "м"};

uint8_t* ITEM_SERVICE_INFO[] = {"Сервисное обслуживание", "Дата следующего сервисного", "обслуживания", "Сервис выполнен", "Необходимо провести сервис", "Следующее сервисное обслуживание","сделать через:", "3", "6", "9", "12", "Месяцев"};

uint8_t* ITEM_LOAD_TYPE[] = {"По времени", "Отложенная", "Немедленная", "Тип промывки"};

uint8_t* ITEM_INPUT_ONE_FRAME[] = {"Удаленный запуск промывки", "Запрет промывки", "ВХ1"};

uint8_t* ITEM_UNIVERSAL_OUTPUT_FRAME[] = {"Не активен", "Промывка фильтра", "Импульсный выход", "Запуск в промывку соседа", "ВЫХ1"};

uint8_t* ITEM_EL_MAG_FRAME[] = {"Удаленный запуск промывки", "Запрет промывки", "ВЫХ2"};


uint8_t* ITEM_TIME_ruText[] = {
	"Дата/Время",
	"Установка даты и времени",
	"Год",
	"Месяц",
	"День",
	"Час",
	"Минуты",
	"Сохранить",
	"Сброс",
	"Установка даты и времени",
	"Введите год",
	"Введите месяц",
	"Введите день",
	"Введите час",
	"Введите минуты"
};